app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @article = Article.find_by_id(params[:id])